zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC54018JBD208-pinctrl.h
#define FC9_RTS_SCL_SSEL1_PIO3_14 IOCON_MUX(110, IOCON_TYPE_D, 2) /* PIO3_14 */
#define GPIO_PIO314_PIO3_14 IOCON_MUX(110, IOCON_TYPE_D, 0) /* PIO3_14 */
#define SCT0_OUT4_PIO3_14 IOCON_MUX(110, IOCON_TYPE_D, 1) /* PIO3_14 */
#define SWD_TRACEDATA2_PIO3_14 IOCON_MUX(110, IOCON_TYPE_D, 7) /* PIO3_14 */
#define FC8_SCK_PIO3_15 IOCON_MUX(111, IOCON_TYPE_D, 1) /* PIO3_15 */
#define GPIO_PIO315_PIO3_15 IOCON_MUX(111, IOCON_TYPE_D, 0) /* PIO3_15 */
#define SD_WR_PRT_PIO3_15 IOCON_MUX(111, IOCON_TYPE_D, 2) /* PIO3_15 */
#define FC8_RXD_SDA_MOSI_PIO3_16 IOCON_MUX(112, IOCON_TYPE_D, 1) /* PIO3_16 */
#define GPIO_PIO316_PIO3_16 IOCON_MUX(112, IOCON_TYPE_D, 0) /* PIO3_16 */
#define SDIF_SD_D4_PIO3_16 IOCON_MUX(112, IOCON_TYPE_D, 2) /* PIO3_16 */
#define FC8_TXD_SCL_MISO_PIO3_17 IOCON_MUX(113, IOCON_TYPE_D, 1) /* PIO3_17 */
#define GPIO_PIO317_PIO3_17 IOCON_MUX(113, IOCON_TYPE_D, 0) /* PIO3_17 */
#define SDIF_SD_D5_PIO3_17 IOCON_MUX(113, IOCON_TYPE_D, 2) /* PIO3_17 */
#define CAN0_TD_PIO3_18 IOCON_MUX(114, IOCON_TYPE_D, 4) /* PIO3_18 */
#define CTIMER4_MATCH0_PIO3_18 IOCON_MUX(114, IOCON_TYPE_D, 3) /* PIO3_18 */
#define FC8_CTS_SDA_SSEL0_PIO3_18 IOCON_MUX(114, IOCON_TYPE_D, 1) /* PIO3_18 */
#define GPIO_PIO318_PIO3_18 IOCON_MUX(114, IOCON_TYPE_D, 0) /* PIO3_18 */
#define SCT0_OUT5_PIO3_18 IOCON_MUX(114, IOCON_TYPE_D, 5) /* PIO3_18 */
#define SDIF_SD_D6_PIO3_18 IOCON_MUX(114, IOCON_TYPE_D, 2) /* PIO3_18 */
#define CAN0_RD_PIO3_19 IOCON_MUX(115, IOCON_TYPE_D, 4) /* PIO3_19 */
#define CTIMER4_MATCH1_PIO3_19 IOCON_MUX(115, IOCON_TYPE_D, 3) /* PIO3_19 */
#define FC8_RTS_SCL_SSEL1_PIO3_19 IOCON_MUX(115, IOCON_TYPE_D, 1) /* PIO3_19 */
#define GPIO_PIO319_PIO3_19 IOCON_MUX(115, IOCON_TYPE_D, 0) /* PIO3_19 */
#define SCT0_OUT6_PIO3_19 IOCON_MUX(115, IOCON_TYPE_D, 5) /* PIO3_19 */
#define SDIF_SD_D7_PIO3_19 IOCON_MUX(115, IOCON_TYPE_D, 2) /* PIO3_19 */
#define CLKOUT_PIO3_20 IOCON_MUX(116, IOCON_TYPE_D, 3) /* PIO3_20 */
#define FC9_SCK_PIO3_20 IOCON_MUX(116, IOCON_TYPE_D, 1) /* PIO3_20 */
#define GPIO_PIO320_PIO3_20 IOCON_MUX(116, IOCON_TYPE_D, 0) /* PIO3_20 */
#define SCT0_OUT7_PIO3_20 IOCON_MUX(116, IOCON_TYPE_D, 5) /* PIO3_20 */
#define SD_CARD_INT_N_PIO3_20 IOCON_MUX(116, IOCON_TYPE_D, 2) /* PIO3_20 */
#define ADC0_CH9_PIO3_21 IOCON_MUX(117, IOCON_TYPE_D, 0) /* PIO3_21 */
#define CTIMER4_MATCH3_PIO3_21 IOCON_MUX(117, IOCON_TYPE_D, 3) /* PIO3_21 */
#define FC9_RXD_SDA_MOSI_PIO3_21 IOCON_MUX(117, IOCON_TYPE_D, 1) /* PIO3_21 */
#define GPIO_PIO321_PIO3_21 IOCON_MUX(117, IOCON_TYPE_D, 0) /* PIO3_21 */
#define SD_BACKEND_PWR_PIO3_21 IOCON_MUX(117, IOCON_TYPE_D, 2) /* PIO3_21 */
#define UTICK0_CAPTURE2_PIO3_21 IOCON_MUX(117, IOCON_TYPE_D, 4) /* PIO3_21 */
#define ADC0_CH10_PIO3_22 IOCON_MUX(118, IOCON_TYPE_D, 0) /* PIO3_22 */
#define FC9_TXD_SCL_MISO_PIO3_22 IOCON_MUX(118, IOCON_TYPE_D, 1) /* PIO3_22 */
#define GPIO_PIO322_PIO3_22 IOCON_MUX(118, IOCON_TYPE_D, 0) /* PIO3_22 */
#define FC2_CTS_SDA_SSEL0_PIO3_23 IOCON_MUX(119, IOCON_TYPE_D, 1) /* PIO3_23 */
#define GPIO_PIO323_PIO3_23 IOCON_MUX(119, IOCON_TYPE_D, 0) /* PIO3_23 */
#define UTICK0_CAPTURE3_PIO3_23 IOCON_MUX(119, IOCON_TYPE_D, 3) /* PIO3_23 */
#define CTIMER4_CAPTURE0_PIO3_24 IOCON_MUX(120, IOCON_TYPE_D, 2) /* PIO3_24 */
#define FC2_RTS_SCL_SSEL1_PIO3_24 IOCON_MUX(120, IOCON_TYPE_D, 1) /* PIO3_24 */
#define GPIO_PIO324_PIO3_24 IOCON_MUX(120, IOCON_TYPE_D, 0) /* PIO3_24 */
#define USB0_VBUS_PIO3_24 IOCON_MUX(120, IOCON_TYPE_D, 3) /* PIO3_24 */
#define CTIMER4_CAPTURE2_PIO3_25 IOCON_MUX(121, IOCON_TYPE_D, 2) /* PIO3_25 */
#define EMC_EMC_A14_PIO3_25 IOCON_MUX(121, IOCON_TYPE_D, 6) /* PIO3_25 */
#define FC4_SCK_PIO3_25 IOCON_MUX(121, IOCON_TYPE_D, 3) /* PIO3_25 */
#define GPIO_PIO325_PIO3_25 IOCON_MUX(121, IOCON_TYPE_D, 0) /* PIO3_25 */
#define EMC_EMC_A15_PIO3_26 IOCON_MUX(122, IOCON_TYPE_D, 6) /* PIO3_26 */
#define FC4_RXD_SDA_MOSI_PIO3_26 IOCON_MUX(122, IOCON_TYPE_D, 3) /* PIO3_26 */
#define GPIO_PIO326_PIO3_26 IOCON_MUX(122, IOCON_TYPE_D, 0) /* PIO3_26 */
#define SCT0_OUT0_PIO3_26 IOCON_MUX(122, IOCON_TYPE_D, 2) /* PIO3_26 */
#define EMC_EMC_A16_PIO3_27 IOCON_MUX(123, IOCON_TYPE_D, 6) /* PIO3_27 */
#define FC4_TXD_SCL_MISO_PIO3_27 IOCON_MUX(123, IOCON_TYPE_D, 3) /* PIO3_27 */
#define GPIO_PIO327_PIO3_27 IOCON_MUX(123, IOCON_TYPE_D, 0) /* PIO3_27 */
#define SCT0_OUT1_PIO3_27 IOCON_MUX(123, IOCON_TYPE_D, 2) /* PIO3_27 */
#define EMC_EMC_A17_PIO3_28 IOCON_MUX(124, IOCON_TYPE_D, 6) /* PIO3_28 */
#define FC4_CTS_SDA_SSEL0_PIO3_28 IOCON_MUX(124, IOCON_TYPE_D, 3) /* PIO3_28 */
#define GPIO_PIO328_PIO3_28 IOCON_MUX(124, IOCON_TYPE_D, 0) /* PIO3_28 */
#define SCT0_OUT2_PIO3_28 IOCON_MUX(124, IOCON_TYPE_D, 2) /* PIO3_28 */
#define EMC_EMC_A18_PIO3_29 IOCON_MUX(125, IOCON_TYPE_D, 6) /* PIO3_29 */
#define FC4_RTS_SCL_SSEL1_PIO3_29 IOCON_MUX(125, IOCON_TYPE_D, 3) /* PIO3_29 */
#define GPIO_PIO329_PIO3_29 IOCON_MUX(125, IOCON_TYPE_D, 0) /* PIO3_29 */
#define SCT0_OUT3_PIO3_29 IOCON_MUX(125, IOCON_TYPE_D, 2) /* PIO3_29 */
#define EMC_EMC_A19_PIO3_30 IOCON_MUX(126, IOCON_TYPE_D, 6) /* PIO3_30 */
#define FC4_SSEL2_PIO3_30 IOCON_MUX(126, IOCON_TYPE_D, 3) /* PIO3_30 */
#define FC9_CTS_SDA_SSEL0_PIO3_30 IOCON_MUX(126, IOCON_TYPE_D, 1) /* PIO3_30 */
#define GPIO_PIO330_PIO3_30 IOCON_MUX(126, IOCON_TYPE_D, 0) /* PIO3_30 */
#define SCT0_OUT4_PIO3_30 IOCON_MUX(126, IOCON_TYPE_D, 2) /* PIO3_30 */
#define CTIMER4_MATCH2_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 3) /* PIO3_31 */
#define EMC_EMC_A20_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 6) /* PIO3_31 */
#define FC9_RTS_SCL_SSEL1_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 1) /* PIO3_31 */
#define GPIO_PIO331_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 0) /* PIO3_31 */
#define SCT0_IN0_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 5) /* PIO3_31 */
#define SCT0_IN1_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 5) /* PIO3_31 */
#define SCT0_IN2_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 5) /* PIO3_31 */
#define SCT0_IN3_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 5) /* PIO3_31 */
#define SCT0_IN4_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 5) /* PIO3_31 */
#define SCT0_IN5_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 5) /* PIO3_31 */
#define SCT0_IN6_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 5) /* PIO3_31 */
#define SCT0_OUT5_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 2) /* PIO3_31 */
#define CTIMER4_CAPTURE1_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 3) /* PIO4_0 */
#define EMC_EMC_CS1_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 6) /* PIO4_0 */
#define FC6_CTS_SDA_SSEL0_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 2) /* PIO4_0 */
#define GPIO_PIO40_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 0) /* PIO4_0 */
#define SCT0_IN0_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 5) /* PIO4_0 */
#define SCT0_IN1_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 5) /* PIO4_0 */
#define SCT0_IN2_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 5) /* PIO4_0 */
#define SCT0_IN3_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 5) /* PIO4_0 */
#define SCT0_IN4_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 5) /* PIO4_0 */
#define SCT0_IN5_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 5) /* PIO4_0 */
#define SCT0_IN6_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 5) /* PIO4_0 */
#define EMC_EMC_CS2_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 6) /* PIO4_1 */
#define FC6_SCK_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 2) /* PIO4_1 */
#define GPIO_PIO41_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 0) /* PIO4_1 */
#define SCT0_IN0_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 5) /* PIO4_1 */
#define SCT0_IN1_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 5) /* PIO4_1 */
#define SCT0_IN2_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 5) /* PIO4_1 */
#define SCT0_IN3_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 5) /* PIO4_1 */
#define SCT0_IN4_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 5) /* PIO4_1 */
#define SCT0_IN5_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 5) /* PIO4_1 */
#define SCT0_IN6_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 5) /* PIO4_1 */
#define EMC_EMC_CS3_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 6) /* PIO4_2 */
#define FC6_RXD_SDA_MOSI_DATA_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 2) /* PIO4_2 */
#define GPIO_PIO42_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 0) /* PIO4_2 */
#define SCT0_IN0_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 5) /* PIO4_2 */
#define SCT0_IN1_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 5) /* PIO4_2 */
#define SCT0_IN2_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 5) /* PIO4_2 */
#define SCT0_IN3_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 5) /* PIO4_2 */
#define SCT0_IN4_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 5) /* PIO4_2 */
#define SCT0_IN5_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 5) /* PIO4_2 */
#define SCT0_IN6_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 5) /* PIO4_2 */
#define CTIMER0_CAPTURE3_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 3) /* PIO4_3 */
#define EMC_EMC_DYCS2_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 6) /* PIO4_3 */
#define FC6_TXD_SCL_MISO_WS_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 2) /* PIO4_3 */
#define GPIO_PIO43_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 0) /* PIO4_3 */
#define SCT0_IN0_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 5) /* PIO4_3 */
#define SCT0_IN1_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 5) /* PIO4_3 */
#define SCT0_IN2_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 5) /* PIO4_3 */
#define SCT0_IN3_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 5) /* PIO4_3 */
#define SCT0_IN4_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 5) /* PIO4_3 */
#define SCT0_IN5_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 5) /* PIO4_3 */
#define SCT0_IN6_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 5) /* PIO4_3 */
#define EMC_EMC_DYCS3_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 6) /* PIO4_4 */
#define FC0_RTS_SCL_SSEL1_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 3) /* PIO4_4 */
#define FC4_SSEL3_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 2) /* PIO4_4 */
#define GPIO_PIO44_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 0) /* PIO4_4 */
#define SCT0_IN0_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 5) /* PIO4_4 */
#define SCT0_IN1_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 5) /* PIO4_4 */
#define SCT0_IN2_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 5) /* PIO4_4 */
#define SCT0_IN3_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 5) /* PIO4_4 */
#define SCT0_IN4_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 5) /* PIO4_4 */
#define SCT0_IN5_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 5) /* PIO4_4 */
#define SCT0_IN6_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 5) /* PIO4_4 */
#define CTIMER4_MATCH3_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 4) /* PIO4_5 */
#define EMC_EMC_CKE2_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 6) /* PIO4_5 */
#define FC0_CTS_SDA_SSEL0_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 3) /* PIO4_5 */
#define FC9_CTS_SDA_SSEL0_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 2) /* PIO4_5 */
#define GPIO_PIO45_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 0) /* PIO4_5 */
#define SCT0_IN0_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 5) /* PIO4_5 */
#define SCT0_IN1_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 5) /* PIO4_5 */
#define SCT0_IN2_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 5) /* PIO4_5 */
#define SCT0_IN3_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 5) /* PIO4_5 */
#define SCT0_IN4_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 5) /* PIO4_5 */
#define SCT0_IN5_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 5) /* PIO4_5 */
#define SCT0_IN6_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 5) /* PIO4_5 */
#define EMC_EMC_CKE3_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 6) /* PIO4_6 */
#define FC9_RTS_SCL_SSEL1_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 2) /* PIO4_6 */
#define GPIO_PIO46_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 0) /* PIO4_6 */
#define SCT0_IN0_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 5) /* PIO4_6 */
#define SCT0_IN1_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 5) /* PIO4_6 */
#define SCT0_IN2_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 5) /* PIO4_6 */
#define SCT0_IN3_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 5) /* PIO4_6 */
#define SCT0_IN4_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 5) /* PIO4_6 */
#define SCT0_IN5_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 5) /* PIO4_6 */
#define SCT0_IN6_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 5) /* PIO4_6 */
#define CTIMER4_CAPTURE3_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 2) /* PIO4_7 */
#define GPIO_PIO47_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 0) /* PIO4_7 */
#define SCT0_IN0_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 5) /* PIO4_7 */
#define SCT0_IN1_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 5) /* PIO4_7 */
#define SCT0_IN2_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 5) /* PIO4_7 */
#define SCT0_IN3_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 5) /* PIO4_7 */
#define SCT0_IN4_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 5) /* PIO4_7 */
#define SCT0_IN5_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 5) /* PIO4_7 */
#define SCT0_IN6_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 5) /* PIO4_7 */
#define USB0_FRAME_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 4) /* PIO4_7 */
#define USB0_PORTPWRN_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 3) /* PIO4_7 */
#define ENET_ENET_TXD0_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 1) /* PIO4_8 */
#define FC2_SCK_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 2) /* PIO4_8 */
#define GPIO_PIO48_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 0) /* PIO4_8 */
#define SCT0_IN0_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 5) /* PIO4_8 */
#define SCT0_IN1_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 5) /* PIO4_8 */
#define SCT0_IN2_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 5) /* PIO4_8 */
#define SCT0_IN3_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 5) /* PIO4_8 */
#define SCT0_IN4_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 5) /* PIO4_8 */
#define SCT0_IN5_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 5) /* PIO4_8 */
#define SCT0_IN6_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 5) /* PIO4_8 */
#define USB0_LEDN_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 4) /* PIO4_8 */
#define USB0_OVERCURRENTN_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 3) /* PIO4_8 */
#define ENET_ENET_TXD1_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 1) /* PIO4_9 */
#define FC2_RXD_SDA_MOSI_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 2) /* PIO4_9 */
#define GPIO_PIO49_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 0) /* PIO4_9 */
#define SCT0_IN0_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 5) /* PIO4_9 */
#define SCT0_IN1_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 5) /* PIO4_9 */
#define SCT0_IN2_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 5) /* PIO4_9 */
#define SCT0_IN3_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 5) /* PIO4_9 */
#define SCT0_IN4_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 5) /* PIO4_9 */
#define SCT0_IN5_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 5) /* PIO4_9 */
#define SCT0_IN6_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 5) /* PIO4_9 */
#define USB1_FRAME_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 4) /* PIO4_9 */
#define USB1_PORTPWRN_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 3) /* PIO4_9 */
#define ENET_RX_DV_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 1) /* PIO4_10 */
#define FC2_TXD_SCL_MISO_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 2) /* PIO4_10 */
#define GPIO_PIO410_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 0) /* PIO4_10 */
#define SCT0_IN0_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 5) /* PIO4_10 */
#define SCT0_IN1_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 5) /* PIO4_10 */
#define SCT0_IN2_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 5) /* PIO4_10 */
#define SCT0_IN3_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 5) /* PIO4_10 */
#define SCT0_IN4_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 5) /* PIO4_10 */
#define SCT0_IN5_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 5) /* PIO4_10 */
#define SCT0_IN6_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 5) /* PIO4_10 */
#define USB1_LEDN_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 4) /* PIO4_10 */
#define USB1_OVERCURRENTN_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 3) /* PIO4_10 */
#define ENET_ENET_RXD0_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 1) /* PIO4_11 */
#define FC2_CTS_SDA_SSEL0_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 2) /* PIO4_11 */
#define GPIO_PIO411_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 0) /* PIO4_11 */
#define SCT0_IN0_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 5) /* PIO4_11 */
#define SCT0_IN1_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 5) /* PIO4_11 */
#define SCT0_IN2_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 5) /* PIO4_11 */
#define SCT0_IN3_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 5) /* PIO4_11 */
#define SCT0_IN4_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 5) /* PIO4_11 */
#define SCT0_IN5_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 5) /* PIO4_11 */
#define SCT0_IN6_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 5) /* PIO4_11 */
#define USB0_IDVALUE_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 3) /* PIO4_11 */
#define ENET_ENET_RXD1_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 1) /* PIO4_12 */
#define FC2_RTS_SCL_SSEL1_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 2) /* PIO4_12 */
#define GPIO_PIO412_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 0) /* PIO4_12 */
#define SCT0_IN0_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 5) /* PIO4_12 */
#define SCT0_IN1_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 5) /* PIO4_12 */
#define SCT0_IN2_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 5) /* PIO4_12 */
#define SCT0_IN3_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 5) /* PIO4_12 */
#define SCT0_IN4_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 5) /* PIO4_12 */
#define SCT0_IN5_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 5) /* PIO4_12 */
#define SCT0_IN6_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 5) /* PIO4_12 */
#define CTIMER4_MATCH0_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 2) /* PIO4_13 */
#define ENET_TX_EN_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 1) /* PIO4_13 */
#define GPIO_PIO413_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 0) /* PIO4_13 */
#define SCT0_IN0_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 5) /* PIO4_13 */
#define SCT0_IN1_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 5) /* PIO4_13 */
#define SCT0_IN2_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 5) /* PIO4_13 */
#define SCT0_IN3_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 5) /* PIO4_13 */
#define SCT0_IN4_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 5) /* PIO4_13 */
#define SCT0_IN5_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 5) /* PIO4_13 */
#define SCT0_IN6_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 5) /* PIO4_13 */
#define CTIMER4_MATCH1_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 2) /* PIO4_14 */
#define ENET_RX_CLK_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 1) /* PIO4_14 */
#define FC9_SCK_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 3) /* PIO4_14 */
#define GPIO_PIO414_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 0) /* PIO4_14 */
#define SCT0_IN0_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 5) /* PIO4_14 */
#define SCT0_IN1_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 5) /* PIO4_14 */
#define SCT0_IN2_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 5) /* PIO4_14 */
#define SCT0_IN3_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 5) /* PIO4_14 */
#define SCT0_IN4_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 5) /* PIO4_14 */
#define SCT0_IN5_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 5) /* PIO4_14 */
#define SCT0_IN6_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 5) /* PIO4_14 */
#define CTIMER4_MATCH2_PIO4_15 IOCON_MUX(143, IOCON_TYPE_D, 2) /* PIO4_15 */
#define ENET_MDC_PIO4_15 IOCON_MUX(143, IOCON_TYPE_D, 1) /* PIO4_15 */
#define FC9_RXD_SDA_MOSI_PIO4_15 IOCON_MUX(143, IOCON_TYPE_D, 3) /* PIO4_15 */
#define GPIO_PIO415_PIO4_15 IOCON_MUX(143, IOCON_TYPE_D, 0) /* PIO4_15 */
#define CTIMER4_MATCH3_PIO4_16 IOCON_MUX(144, IOCON_TYPE_D, 2) /* PIO4_16 */
#define ENET_MDIO_PIO4_16 IOCON_MUX(144, IOCON_TYPE_D, 1) /* PIO4_16 */
#define FC9_TXD_SCL_MISO_PIO4_16 IOCON_MUX(144, IOCON_TYPE_D, 3) /* PIO4_16 */
#define GPIO_PIO416_PIO4_16 IOCON_MUX(144, IOCON_TYPE_D, 0) /* PIO4_16 */
#define CAN1_TD_PIO4_17 IOCON_MUX(145, IOCON_TYPE_D, 2) /* PIO4_17 */
#define CTIMER1_CAPTURE2_PIO4_17 IOCON_MUX(145, IOCON_TYPE_D, 3) /* PIO4_17 */
#define EMC_EMC_BLS2_PIO4_17 IOCON_MUX(145, IOCON_TYPE_D, 6) /* PIO4_17 */
#define GPIO_PIO417_PIO4_17 IOCON_MUX(145, IOCON_TYPE_D, 0) /* PIO4_17 */
#define UTICK0_CAPTURE0_PIO4_17 IOCON_MUX(145, IOCON_TYPE_D, 4) /* PIO4_17 */
#define CAN1_RD_PIO4_18 IOCON_MUX(146, IOCON_TYPE_D, 2) /* PIO4_18 */
#define CTIMER1_CAPTURE3_PIO4_18 IOCON_MUX(146, IOCON_TYPE_D, 3) /* PIO4_18 */
#define EMC_EMC_BLS3_PIO4_18 IOCON_MUX(146, IOCON_TYPE_D, 6) /* PIO4_18 */
#define GPIO_PIO418_PIO4_18 IOCON_MUX(146, IOCON_TYPE_D, 0) /* PIO4_18 */
#define UTICK0_CAPTURE1_PIO4_18 IOCON_MUX(146, IOCON_TYPE_D, 4) /* PIO4_18 */
#define CTIMER4_CAPTURE2_PIO4_19 IOCON_MUX(147, IOCON_TYPE_D, 4) /* PIO4_19 */
#define EMC_EMC_DQM2_PIO4_19 IOCON_MUX(147, IOCON_TYPE_D, 6) /* PIO4_19 */
#define ENET_ENET_TXD0_PIO4_19 IOCON_MUX(147, IOCON_TYPE_D, 1) /* PIO4_19 */
#define FC2_SCK_PIO4_19 IOCON_MUX(147, IOCON_TYPE_D, 3) /* PIO4_19 */
#define GPIO_PIO419_PIO4_19 IOCON_MUX(147, IOCON_TYPE_D, 0) /* PIO4_19 */
#define SD_CLK_PIO4_19 IOCON_MUX(147, IOCON_TYPE_D, 2) /* PIO4_19 */
#define CTIMER4_CAPTURE3_PIO4_20 IOCON_MUX(148, IOCON_TYPE_D, 4) /* PIO4_20 */
#define EMC_EMC_DQM3_PIO4_20 IOCON_MUX(148, IOCON_TYPE_D, 6) /* PIO4_20 */
#define ENET_ENET_TXD1_PIO4_20 IOCON_MUX(148, IOCON_TYPE_D, 1) /* PIO4_20 */
#define FC2_RXD_SDA_MOSI_PIO4_20 IOCON_MUX(148, IOCON_TYPE_D, 3) /* PIO4_20 */
#define GPIO_PIO420_PIO4_20 IOCON_MUX(148, IOCON_TYPE_D, 0) /* PIO4_20 */
#define SD_CMD_PIO4_20 IOCON_MUX(148, IOCON_TYPE_D, 2) /* PIO4_20 */
#define CTIMER2_MATCH3_PIO4_21 IOCON_MUX(149, IOCON_TYPE_D, 4) /* PIO4_21 */
#define EMC_EMC_D16_PIO4_21 IOCON_MUX(149, IOCON_TYPE_D, 6) /* PIO4_21 */
#define ENET_ENET_TXD2_PIO4_21 IOCON_MUX(149, IOCON_TYPE_D, 1) /* PIO4_21 */
#define FC2_TXD_SCL_MISO_PIO4_21 IOCON_MUX(149, IOCON_TYPE_D, 3) /* PIO4_21 */
#define GPIO_PIO421_PIO4_21 IOCON_MUX(149, IOCON_TYPE_D, 0) /* PIO4_21 */
#define SD_POW_EN_PIO4_21 IOCON_MUX(149, IOCON_TYPE_D, 2) /* PIO4_21 */
#define CTIMER1_MATCH3_PIO4_22 IOCON_MUX(150, IOCON_TYPE_D, 4) /* PIO4_22 */
#define EMC_EMC_D17_PIO4_22 IOCON_MUX(150, IOCON_TYPE_D, 6) /* PIO4_22 */
#define ENET_ENET_TXD3_PIO4_22 IOCON_MUX(150, IOCON_TYPE_D, 1) /* PIO4_22 */
#define FC2_RTS_SCL_SSEL1_PIO4_22 IOCON_MUX(150, IOCON_TYPE_D, 3) /* PIO4_22 */
#define GPIO_PIO422_PIO4_22 IOCON_MUX(150, IOCON_TYPE_D, 0) /* PIO4_22 */
#define SD_CARD_DET_N_PIO4_22 IOCON_MUX(150, IOCON_TYPE_D, 2) /* PIO4_22 */
#define CTIMER1_MATCH0_PIO4_23 IOCON_MUX(151, IOCON_TYPE_D, 5) /* PIO4_23 */
#define EMC_EMC_D18_PIO4_23 IOCON_MUX(151, IOCON_TYPE_D, 6) /* PIO4_23 */
#define ENET_ENET_RXD0_PIO4_23 IOCON_MUX(151, IOCON_TYPE_D, 1) /* PIO4_23 */
#define FC2_CTS_SDA_SSEL0_PIO4_23 IOCON_MUX(151, IOCON_TYPE_D, 3) /* PIO4_23 */
#define GPIO_PIO423_PIO4_23 IOCON_MUX(151, IOCON_TYPE_D, 0) /* PIO4_23 */
#define SD_WR_PRT_PIO4_23 IOCON_MUX(151, IOCON_TYPE_D, 2) /* PIO4_23 */
#define CTIMER1_MATCH1_PIO4_24 IOCON_MUX(152, IOCON_TYPE_D, 5) /* PIO4_24 */
#define EMC_EMC_D19_PIO4_24 IOCON_MUX(152, IOCON_TYPE_D, 6) /* PIO4_24 */
#define ENET_ENET_RXD1_PIO4_24 IOCON_MUX(152, IOCON_TYPE_D, 1) /* PIO4_24 */
#define FC7_RTS_SCL_SSEL1_PIO4_24 IOCON_MUX(152, IOCON_TYPE_D, 3) /* PIO4_24 */
#define GPIO_PIO424_PIO4_24 IOCON_MUX(152, IOCON_TYPE_D, 0) /* PIO4_24 */
#define SD_CARD_INT_N_PIO4_24 IOCON_MUX(152, IOCON_TYPE_D, 2) /* PIO4_24 */
#define CTIMER1_MATCH2_PIO4_25 IOCON_MUX(153, IOCON_TYPE_D, 5) /* PIO4_25 */
#define EMC_EMC_D20_PIO4_25 IOCON_MUX(153, IOCON_TYPE_D, 6) /* PIO4_25 */
#define ENET_ENET_RXD2_PIO4_25 IOCON_MUX(153, IOCON_TYPE_D, 1) /* PIO4_25 */
#define FC7_CTS_SDA_SSEL0_PIO4_25 IOCON_MUX(153, IOCON_TYPE_D, 3) /* PIO4_25 */
#define GPIO_PIO425_PIO4_25 IOCON_MUX(153, IOCON_TYPE_D, 0) /* PIO4_25 */
#define SDIF_SD_D0_PIO4_25 IOCON_MUX(153, IOCON_TYPE_D, 2) /* PIO4_25 */
#define CTIMER1_MATCH3_PIO4_26 IOCON_MUX(154, IOCON_TYPE_D, 5) /* PIO4_26 */
#define EMC_EMC_D21_PIO4_26 IOCON_MUX(154, IOCON_TYPE_D, 6) /* PIO4_26 */
#define ENET_ENET_RXD3_PIO4_26 IOCON_MUX(154, IOCON_TYPE_D, 1) /* PIO4_26 */
#define GPIO_PIO426_PIO4_26 IOCON_MUX(154, IOCON_TYPE_D, 0) /* PIO4_26 */
#define SDIF_SD_D1_PIO4_26 IOCON_MUX(154, IOCON_TYPE_D, 2) /* PIO4_26 */
#define UTICK0_CAPTURE2_PIO4_26 IOCON_MUX(154, IOCON_TYPE_D, 4) /* PIO4_26 */
#define CTIMER1_CAPTURE0_PIO4_27 IOCON_MUX(155, IOCON_TYPE_D, 5) /* PIO4_27 */
#define EMC_EMC_D22_PIO4_27 IOCON_MUX(155, IOCON_TYPE_D, 6) /* PIO4_27 */
#define ENET_TX_EN_PIO4_27 IOCON_MUX(155, IOCON_TYPE_D, 1) /* PIO4_27 */
#define FC1_SCK_PIO4_27 IOCON_MUX(155, IOCON_TYPE_D, 4) /* PIO4_27 */
#define GPIO_PIO427_PIO4_27 IOCON_MUX(155, IOCON_TYPE_D, 0) /* PIO4_27 */
#define SDIF_SD_D2_PIO4_27 IOCON_MUX(155, IOCON_TYPE_D, 2) /* PIO4_27 */
#define CTIMER1_CAPTURE1_PIO4_28 IOCON_MUX(156, IOCON_TYPE_D, 5) /* PIO4_28 */
#define EMC_EMC_D23_PIO4_28 IOCON_MUX(156, IOCON_TYPE_D, 6) /* PIO4_28 */
#define ENET_TX_ER_PIO4_28 IOCON_MUX(156, IOCON_TYPE_D, 1) /* PIO4_28 */
#define FC1_RXD_SDA_MOSI_PIO4_28 IOCON_MUX(156, IOCON_TYPE_D, 4) /* PIO4_28 */
#define GPIO_PIO428_PIO4_28 IOCON_MUX(156, IOCON_TYPE_D, 0) /* PIO4_28 */
#define SDIF_SD_D3_PIO4_28 IOCON_MUX(156, IOCON_TYPE_D, 2) /* PIO4_28 */
#define CTIMER1_CAPTURE2_PIO4_29 IOCON_MUX(157, IOCON_TYPE_D, 5) /* PIO4_29 */
#define EMC_EMC_D24_PIO4_29 IOCON_MUX(157, IOCON_TYPE_D, 6) /* PIO4_29 */
#define ENET_RX_ER_PIO4_29 IOCON_MUX(157, IOCON_TYPE_D, 1) /* PIO4_29 */
