zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC54018JBD208-pinctrl.h
#define FC1_TXD_SCL_MISO_PIO4_29 IOCON_MUX(157, IOCON_TYPE_D, 4) /* PIO4_29 */
#define GPIO_PIO429_PIO4_29 IOCON_MUX(157, IOCON_TYPE_D, 0) /* PIO4_29 */
#define SDIF_SD_D4_PIO4_29 IOCON_MUX(157, IOCON_TYPE_D, 2) /* PIO4_29 */
#define CTIMER1_CAPTURE3_PIO4_30 IOCON_MUX(158, IOCON_TYPE_D, 5) /* PIO4_30 */
#define CTIMER3_MATCH0_PIO4_30 IOCON_MUX(158, IOCON_TYPE_D, 3) /* PIO4_30 */
#define EMC_EMC_D25_PIO4_30 IOCON_MUX(158, IOCON_TYPE_D, 6) /* PIO4_30 */
#define ENET_TX_CLK_PIO4_30 IOCON_MUX(158, IOCON_TYPE_D, 1) /* PIO4_30 */
#define FC1_RTS_SCL_SSEL1_PIO4_30 IOCON_MUX(158, IOCON_TYPE_D, 4) /* PIO4_30 */
#define GPIO_PIO430_PIO4_30 IOCON_MUX(158, IOCON_TYPE_D, 0) /* PIO4_30 */
#define SDIF_SD_D5_PIO4_30 IOCON_MUX(158, IOCON_TYPE_D, 2) /* PIO4_30 */
#define CTIMER3_MATCH1_PIO4_31 IOCON_MUX(159, IOCON_TYPE_D, 3) /* PIO4_31 */
#define EMC_EMC_D26_PIO4_31 IOCON_MUX(159, IOCON_TYPE_D, 6) /* PIO4_31 */
#define ENET_RX_CLK_PIO4_31 IOCON_MUX(159, IOCON_TYPE_D, 1) /* PIO4_31 */
#define FC4_SCK_PIO4_31 IOCON_MUX(159, IOCON_TYPE_D, 4) /* PIO4_31 */
#define GPIO_PIO431_PIO4_31 IOCON_MUX(159, IOCON_TYPE_D, 0) /* PIO4_31 */
#define SDIF_SD_D6_PIO4_31 IOCON_MUX(159, IOCON_TYPE_D, 2) /* PIO4_31 */
#define CTIMER3_MATCH2_PIO5_0 IOCON_MUX(160, IOCON_TYPE_D, 3) /* PIO5_0 */
#define EMC_EMC_D27_PIO5_0 IOCON_MUX(160, IOCON_TYPE_D, 6) /* PIO5_0 */
#define ENET_RX_DV_PIO5_0 IOCON_MUX(160, IOCON_TYPE_D, 1) /* PIO5_0 */
#define FC4_RXD_SDA_MOSI_PIO5_0 IOCON_MUX(160, IOCON_TYPE_D, 4) /* PIO5_0 */
#define GPIO_PIO50_PIO5_0 IOCON_MUX(160, IOCON_TYPE_D, 0) /* PIO5_0 */
#define SDIF_SD_D7_PIO5_0 IOCON_MUX(160, IOCON_TYPE_D, 2) /* PIO5_0 */
#define CTIMER3_MATCH3_PIO5_1 IOCON_MUX(161, IOCON_TYPE_D, 3) /* PIO5_1 */
#define EMC_EMC_D28_PIO5_1 IOCON_MUX(161, IOCON_TYPE_D, 6) /* PIO5_1 */
#define ENET_CRS_PIO5_1 IOCON_MUX(161, IOCON_TYPE_D, 1) /* PIO5_1 */
#define FC4_TXD_SCL_MISO_PIO5_1 IOCON_MUX(161, IOCON_TYPE_D, 4) /* PIO5_1 */
#define GPIO_PIO51_PIO5_1 IOCON_MUX(161, IOCON_TYPE_D, 0) /* PIO5_1 */
#define SDIF_SD_VOLT0_PIO5_1 IOCON_MUX(161, IOCON_TYPE_D, 2) /* PIO5_1 */
#define CTIMER3_CAPTURE0_PIO5_2 IOCON_MUX(162, IOCON_TYPE_D, 3) /* PIO5_2 */
#define EMC_EMC_D29_PIO5_2 IOCON_MUX(162, IOCON_TYPE_D, 6) /* PIO5_2 */
#define ENET_COL_PIO5_2 IOCON_MUX(162, IOCON_TYPE_D, 1) /* PIO5_2 */
#define FC4_CTS_SDA_SSEL0_PIO5_2 IOCON_MUX(162, IOCON_TYPE_D, 4) /* PIO5_2 */
#define GPIO_PIO52_PIO5_2 IOCON_MUX(162, IOCON_TYPE_D, 0) /* PIO5_2 */
#define SDIF_SD_VOLT1_PIO5_2 IOCON_MUX(162, IOCON_TYPE_D, 2) /* PIO5_2 */
#define CTIMER3_CAPTURE1_PIO5_3 IOCON_MUX(163, IOCON_TYPE_D, 3) /* PIO5_3 */
#define EMC_EMC_D30_PIO5_3 IOCON_MUX(163, IOCON_TYPE_D, 6) /* PIO5_3 */
#define ENET_MDC_PIO5_3 IOCON_MUX(163, IOCON_TYPE_D, 1) /* PIO5_3 */
#define FC4_RTS_SCL_SSEL1_PIO5_3 IOCON_MUX(163, IOCON_TYPE_D, 4) /* PIO5_3 */
#define GPIO_PIO53_PIO5_3 IOCON_MUX(163, IOCON_TYPE_D, 0) /* PIO5_3 */
#define SDIF_SD_VOLT2_PIO5_3 IOCON_MUX(163, IOCON_TYPE_D, 2) /* PIO5_3 */
#define CTIMER3_CAPTURE2_PIO5_4 IOCON_MUX(164, IOCON_TYPE_D, 3) /* PIO5_4 */
#define EMC_EMC_D31_PIO5_4 IOCON_MUX(164, IOCON_TYPE_D, 6) /* PIO5_4 */
#define ENET_MDIO_PIO5_4 IOCON_MUX(164, IOCON_TYPE_D, 1) /* PIO5_4 */
#define FC4_SSEL2_PIO5_4 IOCON_MUX(164, IOCON_TYPE_D, 4) /* PIO5_4 */
#define GPIO_PIO54_PIO5_4 IOCON_MUX(164, IOCON_TYPE_D, 0) /* PIO5_4 */
#define SD_BACKEND_PWR_PIO5_4 IOCON_MUX(164, IOCON_TYPE_D, 2) /* PIO5_4 */
#define CTIMER3_CAPTURE3_PIO5_5 IOCON_MUX(165, IOCON_TYPE_D, 3) /* PIO5_5 */
#define DMIC0_CLK1_PIO5_5 IOCON_MUX(165, IOCON_TYPE_D, 2) /* PIO5_5 */
#define EMC_EMC_A21_PIO5_5 IOCON_MUX(165, IOCON_TYPE_D, 6) /* PIO5_5 */
#define FC4_SSEL3_PIO5_5 IOCON_MUX(165, IOCON_TYPE_D, 4) /* PIO5_5 */
#define GPIO_PIO55_PIO5_5 IOCON_MUX(165, IOCON_TYPE_D, 0) /* PIO5_5 */
#define SCT0_IN0_PIO5_5 IOCON_MUX(165, IOCON_TYPE_D, 1) /* PIO5_5 */
#define SCT0_IN1_PIO5_5 IOCON_MUX(165, IOCON_TYPE_D, 1) /* PIO5_5 */
#define SCT0_IN2_PIO5_5 IOCON_MUX(165, IOCON_TYPE_D, 1) /* PIO5_5 */
#define SCT0_IN3_PIO5_5 IOCON_MUX(165, IOCON_TYPE_D, 1) /* PIO5_5 */
#define SCT0_IN4_PIO5_5 IOCON_MUX(165, IOCON_TYPE_D, 1) /* PIO5_5 */
#define SCT0_IN5_PIO5_5 IOCON_MUX(165, IOCON_TYPE_D, 1) /* PIO5_5 */
#define SCT0_IN6_PIO5_5 IOCON_MUX(165, IOCON_TYPE_D, 1) /* PIO5_5 */
#define TRACECLK_PIO5_5 IOCON_MUX(165, IOCON_TYPE_D, 5) /* PIO5_5 */
#define DMIC0_DATA1_PIO5_6 IOCON_MUX(166, IOCON_TYPE_D, 2) /* PIO5_6 */
#define EMC_EMC_A22_PIO5_6 IOCON_MUX(166, IOCON_TYPE_D, 6) /* PIO5_6 */
#define FC5_SCK_PIO5_6 IOCON_MUX(166, IOCON_TYPE_D, 3) /* PIO5_6 */
#define GPIO_PIO56_PIO5_6 IOCON_MUX(166, IOCON_TYPE_D, 0) /* PIO5_6 */
#define SCT0_IN0_PIO5_6 IOCON_MUX(166, IOCON_TYPE_D, 1) /* PIO5_6 */
#define SCT0_IN1_PIO5_6 IOCON_MUX(166, IOCON_TYPE_D, 1) /* PIO5_6 */
#define SCT0_IN2_PIO5_6 IOCON_MUX(166, IOCON_TYPE_D, 1) /* PIO5_6 */
#define SCT0_IN3_PIO5_6 IOCON_MUX(166, IOCON_TYPE_D, 1) /* PIO5_6 */
#define SCT0_IN4_PIO5_6 IOCON_MUX(166, IOCON_TYPE_D, 1) /* PIO5_6 */
#define SCT0_IN5_PIO5_6 IOCON_MUX(166, IOCON_TYPE_D, 1) /* PIO5_6 */
#define SCT0_IN6_PIO5_6 IOCON_MUX(166, IOCON_TYPE_D, 1) /* PIO5_6 */
#define SCT0_OUT5_PIO5_6 IOCON_MUX(166, IOCON_TYPE_D, 4) /* PIO5_6 */
#define SWD_TRACEDATA0_PIO5_6 IOCON_MUX(166, IOCON_TYPE_D, 5) /* PIO5_6 */
#define EMC_EMC_A23_PIO5_7 IOCON_MUX(167, IOCON_TYPE_D, 6) /* PIO5_7 */
#define FC5_RXD_SDA_MOSI_PIO5_7 IOCON_MUX(167, IOCON_TYPE_D, 3) /* PIO5_7 */
#define GPIO_PIO57_PIO5_7 IOCON_MUX(167, IOCON_TYPE_D, 0) /* PIO5_7 */
#define MCLK_PIO5_7 IOCON_MUX(167, IOCON_TYPE_D, 2) /* PIO5_7 */
#define SCT0_IN0_PIO5_7 IOCON_MUX(167, IOCON_TYPE_D, 1) /* PIO5_7 */
#define SCT0_IN1_PIO5_7 IOCON_MUX(167, IOCON_TYPE_D, 1) /* PIO5_7 */
#define SCT0_IN2_PIO5_7 IOCON_MUX(167, IOCON_TYPE_D, 1) /* PIO5_7 */
#define SCT0_IN3_PIO5_7 IOCON_MUX(167, IOCON_TYPE_D, 1) /* PIO5_7 */
#define SCT0_IN4_PIO5_7 IOCON_MUX(167, IOCON_TYPE_D, 1) /* PIO5_7 */
#define SCT0_IN5_PIO5_7 IOCON_MUX(167, IOCON_TYPE_D, 1) /* PIO5_7 */
#define SCT0_IN6_PIO5_7 IOCON_MUX(167, IOCON_TYPE_D, 1) /* PIO5_7 */
#define SCT0_OUT6_PIO5_7 IOCON_MUX(167, IOCON_TYPE_D, 4) /* PIO5_7 */
#define SWD_TRACEDATA1_PIO5_7 IOCON_MUX(167, IOCON_TYPE_D, 5) /* PIO5_7 */
#define DMIC0_CLK0_PIO5_8 IOCON_MUX(168, IOCON_TYPE_D, 2) /* PIO5_8 */
#define EMC_EMC_A24_PIO5_8 IOCON_MUX(168, IOCON_TYPE_D, 6) /* PIO5_8 */
#define FC5_TXD_SCL_MISO_PIO5_8 IOCON_MUX(168, IOCON_TYPE_D, 3) /* PIO5_8 */
#define GPIO_PIO58_PIO5_8 IOCON_MUX(168, IOCON_TYPE_D, 0) /* PIO5_8 */
#define SCT0_IN0_PIO5_8 IOCON_MUX(168, IOCON_TYPE_D, 1) /* PIO5_8 */
#define SCT0_IN1_PIO5_8 IOCON_MUX(168, IOCON_TYPE_D, 1) /* PIO5_8 */
#define SCT0_IN2_PIO5_8 IOCON_MUX(168, IOCON_TYPE_D, 1) /* PIO5_8 */
#define SCT0_IN3_PIO5_8 IOCON_MUX(168, IOCON_TYPE_D, 1) /* PIO5_8 */
#define SCT0_IN4_PIO5_8 IOCON_MUX(168, IOCON_TYPE_D, 1) /* PIO5_8 */
#define SCT0_IN5_PIO5_8 IOCON_MUX(168, IOCON_TYPE_D, 1) /* PIO5_8 */
#define SCT0_IN6_PIO5_8 IOCON_MUX(168, IOCON_TYPE_D, 1) /* PIO5_8 */
#define SCT0_OUT7_PIO5_8 IOCON_MUX(168, IOCON_TYPE_D, 4) /* PIO5_8 */
#define SWD_TRACEDATA2_PIO5_8 IOCON_MUX(168, IOCON_TYPE_D, 5) /* PIO5_8 */
#define DMIC0_DATA0_PIO5_9 IOCON_MUX(169, IOCON_TYPE_D, 2) /* PIO5_9 */
#define EMC_EMC_A25_PIO5_9 IOCON_MUX(169, IOCON_TYPE_D, 6) /* PIO5_9 */
#define FC5_CTS_SDA_SSEL0_PIO5_9 IOCON_MUX(169, IOCON_TYPE_D, 3) /* PIO5_9 */
#define GPIO_PIO59_PIO5_9 IOCON_MUX(169, IOCON_TYPE_D, 0) /* PIO5_9 */
#define SCT0_IN0_PIO5_9 IOCON_MUX(169, IOCON_TYPE_D, 1) /* PIO5_9 */
#define SCT0_IN1_PIO5_9 IOCON_MUX(169, IOCON_TYPE_D, 1) /* PIO5_9 */
#define SCT0_IN2_PIO5_9 IOCON_MUX(169, IOCON_TYPE_D, 1) /* PIO5_9 */
#define SCT0_IN3_PIO5_9 IOCON_MUX(169, IOCON_TYPE_D, 1) /* PIO5_9 */
#define SCT0_IN4_PIO5_9 IOCON_MUX(169, IOCON_TYPE_D, 1) /* PIO5_9 */
#define SCT0_IN5_PIO5_9 IOCON_MUX(169, IOCON_TYPE_D, 1) /* PIO5_9 */
#define SCT0_IN6_PIO5_9 IOCON_MUX(169, IOCON_TYPE_D, 1) /* PIO5_9 */
#define SCT0_OUT8_PIO5_9 IOCON_MUX(169, IOCON_TYPE_D, 4) /* PIO5_9 */
#define SWD_TRACEDATA3_PIO5_9 IOCON_MUX(169, IOCON_TYPE_D, 5) /* PIO5_9 */
#define FC5_RTS_SCL_SSEL1_PIO5_10 IOCON_MUX(170, IOCON_TYPE_D, 3) /* PIO5_10 */
#define GPIO_PIO510_PIO5_10 IOCON_MUX(170, IOCON_TYPE_D, 0) /* PIO5_10 */
#define SCT0_IN0_PIO5_10 IOCON_MUX(170, IOCON_TYPE_D, 1) /* PIO5_10 */
#define SCT0_IN1_PIO5_10 IOCON_MUX(170, IOCON_TYPE_D, 1) /* PIO5_10 */
#define SCT0_IN2_PIO5_10 IOCON_MUX(170, IOCON_TYPE_D, 1) /* PIO5_10 */
#define SCT0_IN3_PIO5_10 IOCON_MUX(170, IOCON_TYPE_D, 1) /* PIO5_10 */
#define SCT0_IN4_PIO5_10 IOCON_MUX(170, IOCON_TYPE_D, 1) /* PIO5_10 */
#define SCT0_IN5_PIO5_10 IOCON_MUX(170, IOCON_TYPE_D, 1) /* PIO5_10 */
#define SCT0_IN6_PIO5_10 IOCON_MUX(170, IOCON_TYPE_D, 1) /* PIO5_10 */
#define SCT0_OUT9_PIO5_10 IOCON_MUX(170, IOCON_TYPE_D, 4) /* PIO5_10 */
#define UTICK0_CAPTURE3_PIO5_10 IOCON_MUX(170, IOCON_TYPE_D, 5) /* PIO5_10 */

#endif
